{
  "backend/main.mo": "Defines the main backend actor with ticket/help-topic types, storage/authorization mixins, counters, formatting helpers, and maps for storing tickets and topics.",
  "feature_evidence.json": "Lists feature evidence entries describing required frontend Help Center layout and tooltip changes and their related files.",
  "frontend-file-summaries.txt": "Provides high-level summaries of all frontend files, noting recent UI, layout, and feature updates.",
  "frontend/index.html": "Base HTML file that loads the React app via bootstrap.ts with no-cache headers.",
  "frontend/public/version.json": "Contains version and build timestamp used by the bootstrap version-check system.",
  "frontend/src/App.tsx": "Main React app with tab navigation, admin-gated tabs, theme support, and page routing.",
  "frontend/src/bootstrap.ts": "Handles version checking, cache busting, and dynamic loading of the React app entrypoint.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Renders the header with theme toggle, admin login dialog, and admin navigation dropdown.",
  "frontend/src/components/TicketCounters.tsx": "Renders clickable cards showing ticket counts by platform and status, computing filtered totals from the provided tickets.",
  "frontend/src/components/TicketDetails.tsx": "Displays full ticket details with live refresh, comment submission, status/priority updates, and stored file metadata handling.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity auth, loading identities, and handling login/logout state.",
  "frontend/src/hooks/useQueries.ts": "Implements React Query hooks for fetching, searching, creating, and updating tickets using the backend actor.",
  "frontend/src/hooks/useScrollCues.ts": "Tracks scroll position to expose whether an element can scroll up or down and if the user has scrolled.",
  "frontend/src/index.css": "Defines Tailwind base styles and color variables, including platform, status, and priority themes for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/Analysis.tsx": "Provides an analytics dashboard allowing admins to filter, aggregate, and visualize ticket data via charts.",
  "frontend/src/pages/Dashboard.tsx": "Displays ticket lists with searching, filtering, counters, and detail views for admins.",
  "frontend/src/pages/EditHelpCenter.tsx": "Allows admins to create, edit, delete, and publish help topics with rich‑text editing and hyperlink insertion.",
  "frontend/src/pages/HelpCenter.tsx": "Shows public help topics with platform filtering, search, and topic detail viewing.",
  "frontend/src/pages/SubmitTicket.tsx": "Implements a multi‑step ticket submission form with file uploads, validation, and backend submission.",
  "frontend/src/utils/ticketSafeAccess.ts": "Provides safe normalization and date formatting for ticket objects, applying defaults to avoid crashes from missing fields.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL/session parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, layout, animation, and component styles with custom theme tokens.",
  "project_state.json": "Project metadata describing Help Center tile UI adjustments and tooltip requirements, with no backend or logic changes."
}